# На вход программе подаются 3 целых числа и
# записываются в переменные first, second и third соответственно.
# Ваша задача написать условную конструкцию (из if, elif, else),
# которая выводит кол-во одинаковых чисел среди 3-х введённых.

first = int(input('Уважаемый пользователь, введите число № 1: '))
second = int(input('Уважаемый пользователь, введите число № 2: '))
third = int(input('Уважаемый пользователь, введите число № 3: '))

# Если все числа равны между собой, то вывести 3
if first == second and second == third:
    print(3)

# Если хотя бы 2 из 3 введённых чисел равны между собой, то вывести 2
elif first == second or first == third or second == third:
    print(2)

# Если равных чисел среди 3-х вообще нет, то вывести 0
elif first != second and first != third and second != third:
    print(0)
